app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)
    #@line_item = @cart.line_items.build(product: product)
    #@line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-06-05 06:35:14.328069"], ["updated_at", "2016-06-05 06:35:14.328069"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2016-06-06 19:46:13.919875"], ["updated_at", "2016-06-06 19:46:13.919875"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2016-06-06 19:46:14.339887"], ["id", 1]]