app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    @order.add_items_from_cart(@cart)

# assuming there is a method
    # “add_items_from_cart()” defined in the Order
    # model, will define it later

    respond_to do |format|
      if @order.save
        #destroy the cart
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sushma"], ["address", "3223 Hanford Drive"], ["email", "s@gmail.com"], ["pay_type", "Check"], ["created_at", "2016-06-10 21:38:21.876492"], ["updated_at", "2016-06-10 21:38:21.876492"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 8]]