app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name LIKE '%CoffeeScript%')  ORDER BY created_at DESC