app/controllers/shopper_controller.rb

SELECT "products".* FROM "products"  ORDER BY created_at DESC
---
  def index
@products = Product.all